package com.example.HealthyCampus.common.utils;

public class PhysiqueUtils {


    public static String[] questionList = new String[]{
            "现在先去找个镜子吧" +
                    "\n下面会用到哦",
            "你舌苔的颜色",
            "舌底经络颜色",
            "口腔整体情况",
            "整体生活精神状况",
            "生活中的小问题",
            "饮用水温度偏向",
            "揭晓结果"
    };

    public static String[] physiquesImageUrls = {
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqro2rrhj30c90eydgu.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqro060mj30c90go755.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqrnxrnmj30c90go3zp.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqwvxzwjj30c90goaav.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqrnuqb3j30c90goaar.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqrogotyj30c90goq3u.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqrodvjij30b70cvdlq.jpg",
            "https://ws1.sinaimg.cn/large/0067fcixly1fvtqro7ij0j30970dpafy.jpg"
    };

    public static String[] physiquesExpressions = {
            "平素面色晦暗，皮肤偏暗或色素沉着，容易出现瘀斑，易患疼痛，口唇暗淡或紫，舌质暗有点、片状瘀斑，舌下静脉曲张。" +
                    "眼眶暗黑，鼻部暗滞，发易脱落，皮肤发干，或有出血倾向、吐血，女性多见痛经、闭经、或经血中多有血块，或经色紫黑有块。",
            "手足心热，平常容易口燥咽干，鼻微干，口渴喜冷饮，大便干燥，面色潮红、有烘热感，眼睛干涩视物昏花，唇红微干，" +
                    "皮肤偏干、易生皱纹，眩晕耳鸣，睡眠差，小便短涩。",
            "四季怕冷，手足不温，喜热饮食，精神不振，睡眠偏多。面色柔白，目周晦暗，口唇色淡，毛发易落，大便溏稀，小便清长。",
            "面部皮肤油脂较多，多汗且黏，胸闷，痰多，面色淡黄而暗，眼胞微浮，容易困倦，口黏腻或甜，身重不爽，喜食肥甘甜黏，大便正常或不实，小便不多或微混，平素舌体胖大。",
            "平素面垢油光，容易口苦口干，身重困倦,易生痤疮，体偏胖或苍瘦，心烦懈怠，眼目红赤，大便燥结或黏滞，小便短赤，男易阴囊潮湿，女易带下增多等。",
            "性格内向不稳定，忧郁脆弱，敏感多疑，对精神刺激适应能力较差，平常忧郁面貌，神情多烦闷不乐。胸胁胀满，或走窜疼痛，多伴善太息，或嗳气呃逆，或咽间有异物感，或乳房胀痛，睡眠较差，食欲减退，惊悸怔忡，健忘，痰多，大便多干，小便正常。",
            "平常说话语音低怯，气短懒言，容易疲乏，精神不振，易出汗。面色偏黄或晄白，目光少神，唇色少华，毛发不华，容易头晕，记忆力减退，大便不成形，或便后仍觉未尽，小便正常或偏多。",
            "面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉、味觉良好，唇色红润，不易疲劳，精力充沛，耐受寒热，睡眠良好，食欲好，二便正常。"
    };

    public static String[] physiquesCharacteristics = {
            "瘀血质的人，血行不畅，临床常呈现肤色晦暗、色素沉着、瘀斑、性格抑郁、健忘，舌质紫黯或有瘀点、舌下络脉紫黯或增粗，脉涩。易患痛证、血证、症瘕等。",
            "阴虚质的人，阴液亏少，耐冬不耐夏，临床常呈现口燥咽干、手足心热、喜冷饮、大便干燥，舌红少津，脉细数。一般体形偏瘦，易患虚劳、遗精、失眠等。",
            "阳虚质的人，阳气不足，临床常呈现畏寒怕冷、手足不暖、喜热饮食、精神不振，舌淡胖嫩，脉迟沉。一般性格内向，易患痰饮、肿胀、泄泻等。",
            "痰湿质的人，痰湿凝聚，临床常以形体肥胖、多汗无力、胸闷痰多、腹部肥满、口黏苔腻等痰湿表现为主要特征。",
            "湿热质的人，湿热内蕴，临床常呈现面垢油光、口苦、心烦急躁、口苦口干、身重困倦、大便粘滞不畅或燥结、小便短黄、男性易阴囊潮湿、女性带下增多，易生痤疮，舌质偏红、苔黄腻，脉滑数。",
            "气郁质的人，气机郁滞，临床常呈现精神抑郁、忧虑脆弱、多愁善感、易患脏燥、梅核气、百合病等病症。舌淡红、苔薄白，脉弦。",
            "气虚质的人，元气不足，临床常呈现疲乏气短、自汗懒言、语音低弱、精神不振、肌肉松软不实，舌淡红、边有齿痕，脉虚。易患感冒、内脏下垂、病后康复缓慢等。",
            "平和质的人，阴阳气血调和，体态适中、面色红润、精力充沛、体形匀称健壮、耐受寒热、睡眠良好、患病较少，对自然环境和社会环境适应能力较强。"
    };

    public static String[] physiquesMentalitys = {
            "性情急躁，心情易烦，健忘。",
            "性情急躁，外向好动，活泼。",
            "性格多沉静、内向。",
            "性格偏温和，稳重，恭谦，豁达，多善于忍耐。",
            "性情多急躁易怒。",
            "性格内向不稳定，忧郁脆弱，敏感多疑。",
            "情绪不稳定，胆小，不喜欢冒险。",
            "性格随和开朗。"
    };
    public static String[] physiquesMatters = {
            "瘀血质气机失调，血行不畅，应慎食雪糕、冰淇淋、冰冻饮料等寒凉之品，以免影响气血运行。保持心情舒畅，是淤血质调理的重要环节。",
            "阴虚质体内阴液不足，药膳应慎食辛辣刺激、煎炒爆炸以及羊肉、狗肉等温热之物，以免耗伤阴液。",
            "阳虚质阳气亏虚，药膳应忌生冷寒凉，即使盛夏，也不主张多吃诸如西瓜、梨、苦瓜等寒凉生冷之物，以免损伤阳气。",
            "痰湿质痰湿偏盛，药膳应慎食肥甘油腻、厚味滋补之物，以免助湿生痰。",
            "湿热质体内湿热偏盛，药膳应慎食牛肉、狗肉、鹿肉、辣椒、姜、葱及肥甘厚味之物，以免助湿生热。",
            "气郁质气机不畅，心情抑郁，，应慎食雪糕、冰淇淋、冰冻饮料等寒凉之品，以免影响气血运行。同淤血质一样，保持心情舒畅，也是气郁质调理的重要环节。",
            "气虚质中气不足，脾胃消化功能较弱，药膳应忌过于粘腻、寒凉或难以消化之物，以免食滞难化，影响脾胃功能。",
            "平和质人阴阳气血平衡，药膳调理不可偏补、贪补，以保持人体阴阳平衡状态最为紧要。所谓“不伤不扰，顺其自然”。"
    };

    public static String[] physiques = {"淤血质", "阴虚质", "阳虚质", "痰湿质", "湿热质", "气郁质", "气虚质", "平和质"};

    public static String[][] answerList = new String[][]{
            {"开始吧", "", ""},
            {"深红", "偏白", "淡红"},
            {"暗紫", "细红", "不明显"},
            {"口舌干燥", "口黏苔腻", "还算正常"},
            {"沉寂易疲劳", "精力充沛",""},
            {"多汗无力、易胖", "多愁善感", "都不"},
            {"烫的", "冷的", "没有特别喜欢的"},
            {"查看", "", ""}
    };
    public static int[] colors = {0xffdef6f9, 0xffd6eeec, 0xffB2EBF2, 0xffB2DFDB, 0xff8ed0ca, 0xff80CBC4, 0xff4DB6AC, 0xff3c948b};

}
